[{"fields": {"model": "logentry", "app_label": "admin"}, "model": "contenttypes.contenttype", "pk": 1}, {"fields": {"model": "permission", "app_label": "auth"}, "model": "contenttypes.contenttype", "pk": 2}, {"fields": {"model": "group", "app_label": "auth"}, "model": "contenttypes.contenttype", "pk": 3}, {"fields": {"model": "user", "app_label": "auth"}, "model": "contenttypes.contenttype", "pk": 4}, {"fields": {"model": "contenttype", "app_label": "contenttypes"}, "model": "contenttypes.contenttype", "pk": 5}, {"fields": {"model": "session", "app_label": "sessions"}, "model": "contenttypes.contenttype", "pk": 6}, {"fields": {"model": "article", "app_label": "news_readr"}, "model": "contenttypes.contenttype", "pk": 7}, {"fields": {"expire_date": "2015-10-17T19:12:42.637Z", "session_data": "MDY4NmJhYWNjZmQxMDQ4MTU5NjVlNGFlYjU3OTI0MTZiYWEwZWQwNjp7Il9hdXRoX3VzZXJfaGFzaCI6IjY2NTNjMmYzYzQ1ZTExODU2ZTlhZjliMzQwNWNhMzhmMDYzOWQzYjciLCJfYXV0aF91c2VyX2JhY2tlbmQiOiJkamFuZ28uY29udHJpYi5hdXRoLmJhY2tlbmRzLk1vZGVsQmFja2VuZCIsIl9hdXRoX3VzZXJfaWQiOiIxIn0="}, "model": "sessions.session", "pk": "14056foak8rvv9u3afodiv4ly2lnvudv"}, {"fields": {"expire_date": "2015-10-16T07:46:01.984Z", "session_data": "MDY4NmJhYWNjZmQxMDQ4MTU5NjVlNGFlYjU3OTI0MTZiYWEwZWQwNjp7Il9hdXRoX3VzZXJfaGFzaCI6IjY2NTNjMmYzYzQ1ZTExODU2ZTlhZjliMzQwNWNhMzhmMDYzOWQzYjciLCJfYXV0aF91c2VyX2JhY2tlbmQiOiJkamFuZ28uY29udHJpYi5hdXRoLmJhY2tlbmRzLk1vZGVsQmFja2VuZCIsIl9hdXRoX3VzZXJfaWQiOiIxIn0="}, "model": "sessions.session", "pk": "a4jckdcnrjjfra36hp2pwq5r0sgsze3c"}, {"fields": {"expire_date": "2015-10-12T19:38:21.001Z", "session_data": "MDY4NmJhYWNjZmQxMDQ4MTU5NjVlNGFlYjU3OTI0MTZiYWEwZWQwNjp7Il9hdXRoX3VzZXJfaGFzaCI6IjY2NTNjMmYzYzQ1ZTExODU2ZTlhZjliMzQwNWNhMzhmMDYzOWQzYjciLCJfYXV0aF91c2VyX2JhY2tlbmQiOiJkamFuZ28uY29udHJpYi5hdXRoLmJhY2tlbmRzLk1vZGVsQmFja2VuZCIsIl9hdXRoX3VzZXJfaWQiOiIxIn0="}, "model": "sessions.session", "pk": "sfueev18nud4l5y0m4pwyj0ay4oheavd"}, {"fields": {"category": "Phones/OS", "body": "US-TECHONOLOGY-GOOGLE\r\nWhat better way to close out the busy month of September than with a Google event? Nearly three weeks after Apple announced its latest smartphones, the iPhone 6s and 6s Plus, the search giant is preparing to do the same, with a keynote of its own tomorrow in San Francisco. But while the event will likely focus on a refreshed set of Nexus handsets and the upcoming public release of Android Marshmallow, there are signs that Google is also planning to deliver a couple new Chromecast products -- including one that's all about audio. We also wouldn't be surprised to hear more about Android Wear, especially since we've seen a number of new devices introduced over the past month, like Motorola's second-generation 360 and the Huawei Watch. All will be revealed tomorrow, but for now, let's break down the leaks and rumors.\r\n\r\nThe Nexus 5X and 6P\r\n\r\n\r\nAlmost a year after its release, Google's Nexus 6 isn't exactly what we'd call a hit. The reasons? Its battery life was nothing to write home about, while the camera left much to be desired. Also, some people weren't willing to give up a comfortable one-handed experience in exchange for a large screen. Google might've been better off having a smaller option for them, rather than a single massive phone. But now, the company seems to want to get back to the days of the successful, LG-made Nexus 5, one of its best smartphones to date -- both in terms of software and hardware. To do so, it appears the company is teaming up with LG yet again, this time on a device called the Nexus 5X, which actually looks a lot like the Nexus 5, if these leaked images are to be believed.\r\n\r\nUnder the hood, the 5X reportedly packs a 5.2-inch (1080p) display, Snapdragon 808 processor, up to 3GB of RAM, a 13-megapixel camera, fingerprint sensor and a USB Type-C port. It also looks like you'll have a variety of colors to choose from, including black, white and a less traditional (but pretty) mint green. According to multiple news outlets, the Nexus 5X is also said to be priced starting at $380 for the 16GB model, or $100 more for 32GB.\r\n\r\n\r\nNow, back to smartphones with big screens. This year, Google appears to be taking a slightly different approach than in years past, announcing two Nexus devices simultaneously. According to the rumor mill, Google is partnering with not only LG, but also Huawei. Leaks suggest that the Chinese firm is making the larger of the two Nexuses, the 6P. It reportedly features a 5.7-inch, 2,560 x 1,440 display, Snapdragon 810 processor, a fingerprint sensor on the back, dual front speakers, USB Type-C and a beefy 3,450mAh battery. Of the two, this would obviously be pegged as the higher-end model, but that's not to say the Nexus 5X isn't also appealing on paper. Android Police says pricing is set to be $500 for the 32GB version.\r\n\r\nNot surprisingly, both will run Marshmallow at launch, although Google has yet to confirm a release date for its new software. Let's not forget the fingerprint-reading scanners either: These will be the first Nexus devices to offer this feature, which you'll need to take advantage of the soon-to-be released Android Pay. For the sake of all our impatient readers out there, let's hope Google starts selling these new Nexus phones as soon as tomorrow, or at least puts them up for pre-order.\r\n\r\nAndroid Marshmallow\r\n\r\n\r\nSpeaking of Android Marshmallow, chances are we'll learn more about its release date; other than revealing the OS' official name, Google has been stingy on details. Still, we do know that one main feature Marshmallow brings to the table is support for fingerprint readers, so it's nice (and unsurprising) to see that both Nexus 5X and 6P apparently support this kind of authentication.\r\n\r\nBeyond that, there's probably going to be talk about when Marshmallow is expected to hit existing devices. Of course, Google's own Nexus smartphones will be first in line to receive the update, but here's hoping carriers and OEMs don't take their sweet time to bring it to as many handsets as possible.\r\n\r\nChromecast... for audio?\r\n\r\n\r\n\r\nIt's safe to say the Chromecast is among Google's most popular devices. The tiny dongle, which basically turns any dumb TV into a smart one, is affordable, functional and easy for anyone to use. Word on the street is that the second generation of the device will see a few modest changes inside and out. There's talk of a new design, for instance, as well as support for faster 802.11ac WiFi and 5GHz networks. It'll be interesting to find out if Google keeps it at $35 or decides to modify that insanely cheap price.\r\n\r\nSurprisingly, Google reportedly wants to make that winning formula work for audio too, in addition to just video. According to 9to5Google, a device code-named \"Hendrix\" will be making its debut tomorrow, which is rumored to add wireless connectivity to any old speakers you may have lying around -- so long as they have a 3.5mm headphone jack. If Chromecast Audio ends up being real, it would allow people to network their existing speakers with a simple dongle; think of it as a cheap way to upgrade to a Sonos-esque setup. No word on how much it's going to cost, but we wouldn't be surprised if Google chose to be aggressive and priced it around the same as the Chromecast.\r\n\r\nAndroid Wear, Android TV and everything else\r\n\r\n\r\n\r\nAll signs point toward Nexus, Android and Chromecast being the standouts at tomorrow's event. But, don't be surprised if we hear more about Android Wear compatibility with Marshmallow, as well as upgrades to Android TV and Android Auto.\r\n\r\nWe'll be liveblogging the action as it happens tomorrow, so be sure to tune into our dedicated page at 9 AM PT/12 PM ET.", "published_on": "2015-09-28T19:42:56Z", "author": "Edgar Alvarez", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "", "updated_on": "2015-09-28T19:46:29.400Z", "upvotes": 0, "title": "What to expect from Google's Nexus and Android event", "added_on": "2015-09-28T19:46:29.400Z"}, "model": "news_readr.article", "pk": 1}, {"fields": {"category": "Phones/OS", "body": "Samsung will rebate monthly lease and installment payments for the latest Galaxy smartphones up to $120 and will kick in $100 more for trading in an iPhone.\r\n\r\nSecurity in cloud computing\r\nAfter pushing malware, ad networks also used for DDoS\r\nExperts believe a recent large-scale distributed denial-of-service attack was launched through\r\nREAD NOW\r\nThe offer, described online on Sunday, excludes devices sold or running on the AT&T network. But it does apparently apply to a lease or installment plan from T-Mobile, Sprint, Verizon Wireless or US Cellular. The devices that are eligible are the Galaxy S6, Galaxy S6 Edge, Galaxy Note 5 and the Galaxy S6 Edge Plus.\r\n\r\nIn one example, a Galaxy S6 through Verizon would require a $24 monthly payment for 24 months to pay off the device. Samsung's offer covers those payments up to $120. The redemption period ends Oct. 9, according to online conditions.\r\n\r\nFor smartphone users switching to Galaxy from the iPhone, the $100 award will come in the form of a $100 Google Play gift card.\r\n\r\nThis isn't the first time Samsung has attempted to lure iPhone customers. In August, Samsung offered U.S. iPhone users a 30-day test drive of a Galaxy phone for $1.\r\n\r\nSamsung has been hot on the tail of Apple for years, and is expected to set up its own leasing program; Apple announced the iPhone Upgrade Program on Sept. 9. \"If Apple does it, then it must be good enough for Samsung,\" said Roger Entner, an analyst at Recon Analytics.\r\n\r\n\r\nIn other news, Samsung announced the official launch of Samsung Pay in the U.S. on Monday, although the company had previously supported NFC payments on recent Galaxy devices through other payment apps. Samsung Pay was unveiled in March.\r\n\r\nSamsung Pay works on Galaxy S6, S6Ege, Note 5 and S6 Edge Plus devices that run on AT&T, T-Mobile, Sprint and U.S. Cellular. Samsung Pay is backed by digital tokens, Samsung Knox security and fingerprint authentication. It's compatible with most payment terminals -- including those accepting magnetic stripe, chip cards (ENV) and NFC. Consumers must be using MasterCard, Visa or American Express issued by Bank of America, Citi, American Express or U.S. Bank. Samsung Pay works with magnetic strip card readers, giving wider usage for consumers than Apple Pay, which does not.\r\n\r\nSamsung dinged Apple iPhones for not having wireless charging in a YouTube ad posted on Sept. 10.", "published_on": "2015-09-28T19:47:20Z", "author": "By Matt Hamblen", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "", "updated_on": "2015-09-28T19:47:37.976Z", "upvotes": 0, "title": "Samsung throws more incentives at iPhone users", "added_on": "2015-09-28T19:47:37.976Z"}, "model": "news_readr.article", "pk": 2}, {"fields": {"category": "Virtual Reality", "body": "SAN FRANCISCO — Looking at a picture of the Great Wall of China might cause a student to raise an inquisitive eyebrow. But using technology to feel like they've actually visited the landmark could create a future China scholar.\r\n\r\nThat's at least the dream behind Google Expeditions, a 10-month-old project from the search giant that gives teachers virtual reality tools to teleport students to some of the most intriguing destinations on this planet and others. Beginning Monday, the Mountain View, Calif.-based company will begin visiting thousands of schools in six states as well as in Australia, England and Brazil.\r\n\r\nTeachers who expressed interest online in Expeditions after Google announced the project at its I/O developers conference last May will get all-day access to a kit that includes a tablet (from which teachers control the lesson plan), ASUS smartphones (which slot into Google Cardboard or Mattel View-Masters for the VR experience) and a router that relays the signal between the devices (no in-school Internet connection is required).\r\n\r\nGoogle has yet to say whether it has sales expectations with the program, specifically with regard to the unique teacher-focused content of the VR adventures.\r\n\r\n\r\nUSA TODAY\r\nGoogle, GoPro bring virtual reality to the masses with Jump\r\n\r\n\"Honestly, we haven't gotten that far yet,\" says Ben Schrom, product manager for Expeditions. \"Classrooms are unique environments, especially when it comes to putting technology in them. The idea is to take the tech into the classrooms, help teachers get their head around it and learn more about what we can do with it.\"\r\n\r\nAnother of the project's sponsors, Subaru, is both providing funding for the creation of some of the content (\"They're particularly passionate about reducing landfills,\" says Schrom) as well as a small fleet of vehicles so kits can make the rounds in California, Illinois, New York, New Jersey, Connecticut and Texas. Others states may be added, depending on what new schools express interest by contacting the Expeditions Pioneer Program site. The program is open to classrooms of third graders through college students.\r\n\r\nGoogle Cardboard is a simple smartphone holder made out of cardboard. Directions are available online to make homemade versions as well. Stereoscopic content displayed in a horizontal mode comes to live in two and three dimensions when using such basic phone holders, and represents an inexpensive way to access such media when compared to devices such as Samsung VR and the forthcoming and very pricey Oculus Rift VR goggles.\r\n\r\nTo date, Google has compiled more than 100 VR expeditions to places ranging from the Great Barrier Reef to Mars. Content partners include PBS, Houghton Mifflin Harcourt, The Planetary Society and The Wildlife Conservation Society.\r\n\r\nMuch of the content is amped up two-dimensional fare, some of it culled from from Google's global Street View image-capturing project. But increasingly the Expeditions will feature 3-D video created by Google's new Jump camera rig, which is a GoPro-produced product that holds 16 GoPro cameras all shooting at once, footage that Google then stitches into 3-D video that appears incredibly life-like.\r\n\r\n\"I was in a ninth grade classroom recently and watched as the kids were able to really compare the architecture of the Duomo in Florence and the Pantheon in Rome,\" says Expeditions program manager Jen Holland. \"The teacher had come prepared to talk about this with some black and white photos she had printed out. But to see the kids really come to life when they felt like there were in these places was amazing.\"\r\n\r\nFollow USA TODAY tech reporter Marco della Cava on Twitter: @marcodellacava", "published_on": "2015-09-28T19:47:51Z", "author": "Marco della Cava", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "", "updated_on": "2015-09-28T19:48:13.013Z", "upvotes": 0, "title": "Google rolls out virtual reality field trips", "added_on": "2015-09-28T19:48:13.013Z"}, "model": "news_readr.article", "pk": 3}, {"fields": {"category": "Auto", "body": "German prosecutors launched an investigation on Monday into fraud allegations against former Volkswagen (VOWG_p.DE) boss Martin Winterkorn, showing their determination to get quickly to the bottom of a scandal over rigged emissions tests that has rocked the global car industry.\r\n\r\nThe German company also suspended three top engineers, sources familiar with the matter told Reuters, as it tries to get to grips with a crisis that has knocked more than a third off its market value and could harm Germany's economy.\r\n\r\nVolkswagen has admitted cheating diesel emissions tests in the United States but Germany's transport minister says it also manipulated tests in Europe, where it has much bigger sales, and it faces the worst business crisis in its 78-year history.\r\n\r\nADVERTISING\r\n \r\n\r\nThe German prosecutor's office said it was investigating Winterkorn over \"allegations of fraud in the sale of cars with manipulated emissions data\" based on charges filed by about 10 unidentified individuals.\r\n\r\nWinterkorn, replaced as chief executive on Friday by company veteran Matthias Mueller, said when he quit last week that he was not aware of any wrongdoing on his part and wanted to give the company a new start.\r\n\r\nThe crisis is an embarrassment for Germany, which has for years held up Volkswagen as a model of its engineering prowess and has lobbied against some tighter regulations on automakers. The German car industry employs more than 750,000 people and is a major source of export income.\r\n\r\n\"The car industry is crucial for the German economy. It (the\r\n\r\nscandal) can have a big impact on the German economy,\" Deputy Finance Minister Jens Spahn told a conference.\r\n\r\nIn a sign of Volkswagen's own efforts to tackle the crisis, sources close to the matter said it had suspended Heinz-Jakob Neusser, head of brand development at its core VW brand.\r\n\r\nAlso suspended were Ulrich Hackenberg, the head of research and development at premium brand Audi who oversees technical development across the group, and Wolfgang Hatz, R&D chief at sports-car brand Porsche who heads group engine and transmissions development, they said.\r\n\r\nOne source said Hackenberg was taking legal action against the decision. Volkswagen and Audi declined to comment, while the suspended executives could not immediately be reached.\r\n\r\nWinterkorn, who was at the helm of Volkswagen for nine years and was the highest paid CEO on Germany's blue-chip DAX stock market last year, also could not be reached for comment.\r\n\r\nA source close to Volkswagen's board said its executive committee would meet on Wednesday to discuss the appointment of U.S. law firm Jones Day to lead an external investigation.\r\n\r\nRELATED COVERAGE\r\n› Almost 129,000 VW cars in Switzerland affected by diesel scandal: distributor\r\n› Volkswagen emissions issue affects 1.8 million light commercial vehicles: paper\r\nWARNINGS\r\n\r\nBut the crisis shows no sign of dying down.\r\n\r\nTwo German newspapers said on Sunday Volkswagen's own staff and one of its suppliers had warned years ago about the illegal use of so-called \"defeat devices\" to detect when a car was being tested and alter the running of its diesel engine to conceal their emissions of toxic nitrogen oxides.\r\n\r\nEnvironmental campaign group Transport & Environment (T&E) said on Monday there was a wider industry problem, as it published new data showing some new Mercedes, BMW and Peugeot cars use 50 percent more fuel than laboratory tests indicate.\r\n\r\nT&E said its data did not prove other firms were using defeat devices. But it said the gap between lab and road tests had grown to such an extent for emissions of both carbon dioxide and nitrogen oxides that further investigation was needed to discover what carmakers were doing to manipulate results.\r\n\r\n\"The Volkswagen scandal was just the tip of the iceberg,\" said Greg Archer, clean vehicles manager at T&E, adding the gap between lab tests and road performance cost a typical driver 450 euros ($504) per year.\r\n\r\nACEA, the European Automobile Manufacturers' Association, which represents top carmakers, has said there is no evidence the use of defeat devices is an industry-wide issue.\r\n\r\nIn a statement on Monday, it said it supported the development of updated testing. U.S. and European regulators have said they are working on tighter rules.\r\n\r\nTHE RIGHT CHOICE?\r\n\r\nVolkswagen's market value has fallen by more than 25 billion euros since it admitted to cheating U.S. emissions tests. It faces investigations and potential fines from regulators and prosecutors, as well as lawsuits from cheated customers.\r\n\r\nCustomers and dealers have criticised a lack of information from the company about what will happen to the 11 million vehicles it has said were fitted with defeat devices worldwide.\r\n\r\nRELATED COVERAGE\r\n› EU's Moscovici says VW crisis won't limit German influence in Brussels\r\n› Porsche may pick production chief as CEO this week: sources\r\nThere were signs on Monday the vehicles would be recalled and refitted, with Volkswagen's Swiss distributor saying a plan to refit almost 129,000 cars in its country would be presented to Swiss transport authorities in October.\r\n\r\nVolkswagen's flagship Audi brand said 2.1 million of its cars were affected by the scandal, including the A1, A3, A4, A5, A6, TT, Q3 and Q5 models.\r\n\r\nSpain's industry minister said he would ask Volkswagen's local Seat brand to pay back subsidies it had received for 'fuel-efficient' cars that broke rules.\r\n\r\n\"VW is in a dramatic situation. It will be far from easy to restore the reputation of the company and win back trust from customers,\" new CEO Mueller said in a letter to Porsche staff seen by Reuters.\r\n\r\nSome analysts question whether he is the right man for the job, given his more than three decades at the company.\r\n\r\n\"He has made a career within the VW system, so how could he credibly argue that all will change to the better now?\" said Commerzbank's Sascha Gommel.\r\n\r\nAt 1555 GMT, Volkswagen shares were down 7.5 percent at 99.3 euros.\r\n\r\nManufacturers globally now fear more costly regulations and a drop in diesel car sales.\r\n\r\nDiesel engines use less fuel and emit less carbon -- blamed for global warming -- than standard gasoline engines. But they emit higher levels of toxic nitrogen oxides, linked to deaths from lung and heart disease.\r\n\r\nIn most of the world, diesel engines in passenger cars are a niche product. But their fuel economy and low carbon emissions have made them popular in Europe, where they account for half of vehicles sold.\r\n\r\nVolkswagen and other European manufacturers have promoted \"clean diesel\" technology, but the suggestion this was achieved by cheating on tests could affect the viability of the entire diesel sector.\r\n\r\n(Additional reporting by Reuters bureaus in Europe, Writing by Mark Potter, Editing by Janet McBride and Timothy Heritage)", "published_on": "2015-09-28T19:48:30Z", "author": "ANDREAS CREMER", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "", "updated_on": "2015-09-28T19:48:42.540Z", "upvotes": 0, "title": "Germany investigates VW's ex-boss over fraud allegations", "added_on": "2015-09-28T19:48:42.540Z"}, "model": "news_readr.article", "pk": 4}, {"fields": {"category": "Phones/OS", "body": "“The only thing that’s changed is everything,” says the slogan Apple unveiled along side the iPhone 6s and iPhone 6s Plus. It’s an attempt to address the perception that the odd-year “s” updates to the iPhone line are minimal and uninteresting.\r\n\r\nYes, the “s” models look more or less like their predecessors, but for quite a while Apple has used these cycles to upgrade a lot of the stuff on the inside. This year is no different: The iPhone 6s and 6s Plus offer some major improvements, with better cameras (front and back), much faster processors, more responsive Touch ID, and the single biggest improvement to the iPhone’s user interface in its history.\r\n\r\nBut other than that, y’know, no big deal.\r\n\r\nSame style, different measurements\r\nLet’s start with the part of the iPhone that doesn’t change on “s” models: the outside. While Apple’s new 2015 phones seem indistinguishable from last year’s models, if you check carefully you’ll discover they’re slightly larger and heavier.\r\n\r\nBoth iPhone 6s models are fractions of a millimeter wider, longer, and thicker than their iPhone 6 equivalents. I absolutely couldn’t tell the difference, and the Apple leather case I’ve been using on my iPhone 6 for the last year slipped onto the 6s without any trouble. (Extremely tight, precisely made cases might have trouble fitting the new models, but I’d wager that most cases won’t have any trouble being repurposed for a newer model.)\r\n\r\nThe change in weight, on the other hand—which appears to be related to the addition of 3D Touch sensors under the display, and possibly the new Taptic Engine—well, that’s noticeable. The iPhone 6s and iPhone 6s Plus both feel denser than the iPhone 6 models. The difference is less than an ounce, and it’s less than the weight of my Apple leather case, but it’s there. Just like getting used to the extra weight of a case, after a day or two you probably won’t notice the difference. But it is perceptible in a way that the changes in the iPhone 6s’s dimensions aren’t.\r\n\r\niphone 6s 6splus JASON SNELL\r\niPhone 6s (top) and the iPhone 6s Plus (bottom).\r\n\r\nOne of my least favorite things about the iPhone 6 design is that it feels a bit slippery, like a bar of soap. I never used to put cases on my iPhones, but my iPhone 6 has been in a case for the past year. Early reports suggested that the metal surface of iPhone 6S models, which use the stronger 7000-series aluminum Apple also uses in the Apple Watch Sport, was somehow more tacky or “grippable” than the older phones. When I asked Apple about this, they declined to say anything, and if I’m reading between the lines I think the suggestion there is that Apple doesn’t think there’s any difference.\r\n\r\nYet, I’ve seen people online who are convinced that their iPhone 6S units are less slick than their old phones. I’ve handled a bunch of iPhone 6S models now, and one of them—a 6S in the new Rose Gold color variant, which is pleasantly pink—did indeed feel noticeably tackier to the touch. But I’ve got a silver 6S Plus and a space gray 6S here that feel exactly as slick as last year’s models. It’s not the colors themselves—I heard from someone who is convinced their space gray 6S isn’t as slippery.\r\n\r\nWhat’s happening here? Part of it could be a placebo effect, but my guess is that some change in Apple’s production process-either the manufacture of the aluminum itself or, more likely, the anodization process that each aluminum backplate undergoes—has introduced some variation in the texture of the iPhone’s surface. So if you buy an iPhone 6S, might it be a little bit easier to grip than the iPhone 6? It’s possible, but I sure wouldn’t count on it.\r\n\r\nA touch screen with dimension\r\nThe banner feature of the iPhone 6s and iPhone 6s Plus has got to be 3D Touch, which allows the iPhone to sense how much pressure you’re putting on its screen, and react to that in some interesting ways.\r\n\r\nIf you’re on the home screen and push a little extra harder on an app icon, you’ll usually (apps have to be updated to support this feature) see a menu of up to four Quick Actions. As the menu pops up, you’ll also feel a slight vibration coming from the phone’s Taptic Engine, which can create much more subtle vibration patterns than previous iPhones. In fact, if you push on an app that doesn’t offer Quick Actions, you’ll feel a longer triple-vibration pattern that indicates that there’s nothing to see.\r\n\r\nApple has done a great job integrating haptic feedback into 3D Touch, and the combination of your own sense of pressure on your fingertips and the vibration of the Taptic Engine is greater than the sum of its parts. Because the vibrations provide instant feedback about how hard to push in order to trigger 3D Touch, I never really had a problem triggering the feature accidentally.\r\n\r\n3d touch iphone 6s JASON SNELL\r\nPerform a 3D Touch on an app icon and a pop-up menu appears with tasks you can perform.\r\n\r\nThe items in Quick Actions menus are essentially links to different features or areas of the app whose icon you’re touching, allowing you to open the app and jump quickly to a specific area. For example, rather than opening the Camera app, tapping the icon to switch from the iSight camera to the FaceTime camera, and potentially swiping to get the app into Photo mode, you can just choose Take Selfie from the Quick Action menu. The Camera app opens, automatically switches to Photo mode, and changes to the FaceTime camera\r\n\r\nWhen you are using an app, developers can choose how to use 3D Touch, if at all. Apple has provided the tools for developers to support a convention that it’s using in most of its own apps, which it calls “peek and pop.” When you provide a little bit of pressure on an on-screen item that’s concealing more information—this could be an icon representing a friend, a message in a Mail or Messages list, or a webpage link—the Taptic Engine provides a small vibration as a floating window pops up with a preview of the underlying information. If the item doesn’t interest you, you can remove your finger from the glass and the window goes away. If you want to know more, you can press a little bit harder and you’ll get a stronger vibration as the window “pops” open, just as if you had tapped on it to begin with.\r\n\r\nIt’s a nice feature, a little bit like Quick Look on the Mac. What makes it a bit more intriguing is that you can perform actions right from within the “peek” itself. For example, in Mail I can drag a “peek” to the right to mark a message as unread, or drag it left to archive it. If I drag the “peek” up, I get a menu that lets me choose to reply, forward, move, mark, or set a notification on that message. In Messages, dragging up on a “peek” brings up a list of auto-reply messages, so I can quickly answer a text.\r\n\r\nApp developers can decide if they want to implement “peek and pop” or build their own ways of reacting to 3D Touch. In Apple’s own Notes app, for example, when you’re in drawing mode the app detects the pressure of your finger on the screen and uses it to determine the intensity of the pencil marks. And game developers will undoubtedly find numerous ways to use pressure sensitivity to their advantage.\r\n\r\nI’m a believer in 3D Touch—it provides a fantastic collection of power-user features, but feels natural enough that I think it’ll be adopted by more than just the nerdiest among us. My only real complaint is that some of the gestures while in “peek” mode are hard to do with my usual hand grip. A few times I found myself wanting to swipe on an email to archive it, only to realize my finger just couldn’t move any farther in that direction. And while I could use the nifty new 3D Touch shortcut to switch to the previous app by 3D Touching the left edge of the screen and swiping all the way to the right, on the iPhone 6s Plus my little thumb couldn’t complete the gesture because it couldn’t reach the other side of the screen. Maybe this is a sign to stick with the iPhone 6s and not move to the larger iPhone 6s Plus.\r\n\r\nOne final complaint, of a sort, about 3D Touch: After a few days of using it, I want it everywhere—and it’s not. I can flip up Control Center from the bottom of the screen to quickly open the Camera app, but for some reason I can’t 3D Touch on that Camera icon to bring up its Quick Actions. Why not? Similarly, the new iOS 9 search screen displays suggested app icons, but I can’t use 3D Touch on them, either.\r\n\r\nUpgrading the bump\r\nThe fact is, our smartphones aren’t vital to our lives because they take phone calls. They’re vital because they connect us to the Internet, entertain us with apps, and provide us with a camera that’s always with us. Both of the cameras on the iPhone 6s and iPhone 6s Plus are majorly upgraded from those on last year’s models. (And yes, the rear-facing iSight camera still sticks out from the back of the case, just like on last year’s models.)\r\n\r\nThe iSight camera has been upgraded to 12 megapixels, which allows the camera to capture more detail. The iPhone 6s Plus also offers optical image stabilization for both video and stills—an improvement on the iPhone 6 Plus, which only used OIS for stills.\r\n\r\nIn addition to upgrading the hardware, though, Apple has also introduced a new camera mode, called Live Photos. When you enable Live Photos (by tapping a new Live Photos icon when in the Photo setting of the Camera app), the iPhone is always shooting video and caching it temporarily. When you take a picture, the app grabs the last 1.5 seconds of video and the following 1.5 seconds, and saves that as a movie, alongside the still picture.\r\n\r\nThe idea here is that you’ve sort of captured the closest thing to one of those moving photographs from Harry Potter. It’s a fun idea, and once apps are updated to support the uploads, I expect that they’ll be a lot of fun to share. But I admit I’m a little disappointed about how Live Photos are implemented: When you 3D Touch on a Live Photo, the beautiful 12-megapixel still fades away and is replaced by a 1440-by-1080-pixel (1.55 megapixels) video running at only 15 frames per second. I guess even the impressive hardware on the iPhone 6s and iPhone 6s Plus isn’t capable of capturing a higher resolution at a higher frame rate, but it’s a disappointing drop in quality from that beautiful still image. As a bonus easter egg around a still picture, Live Photos can be fun and silly, but if I’m ever in a situation where I want to capture movement, I’m going to shoot video instead.\r\n\r\nSpeaking of shooting video, these iPhones have received a major upgrade. They can shoot 4K video (3840-by-2160, or four times the pixels of a 1080 HD video). Right now there aren’t a lot of 4K TVs out there, but inevitably there will be someday. 4K video also gives you much more to work with in terms of zooming and cropping video when you edit later, because you can throw away a large chunk of an image and still have full 1080 HD resolution to work with. I imagine that all of those filmmakers who love shooting stuff with iPhones will snap up these new iPhones immediately, just because of the 4K video support.\r\n\r\nAs the parent of a teenager, I have come to appreciate that the FaceTime camera on the front of the iPhone is just as important as the one on the back. (Because selfies.) Apple has also gotten the message—the front-facing camera on the iPhone 6s and iPhone 6s plus is now 5 megapixels, up from 1.2 megapixels, and supports Live Photos and HDR mode. More importantly, Apple has built in a selfie-flash mode that uses the iPhone’s display itself as a flash, driving it to up to three times normal brightness and adjusting the color of the flash to one that’s appropriate for the scene.\r\n\r\nI’m impressed with all of these upgrades, especially on the front-facing camera. For much, much more on the iPhone 6s camera, I encourage you to read the in-depth review by Christopher Phin, which will appear on Macworld.com soon.\r\n\r\nTech upgrades\r\nWith a new iPhone comes a new Apple-designed processor, of course. This time it’s the A9, which for the first time integrates the motion coprocessor—this version’s called the M9—into the same physical chip. The M9 offloads tasks and runs with very, very little power use—handy for things like counting how many steps you take while your phone’s sleeping in your pocket. By integrating it with the larger whole, the iPhone 6s and iPhone 6s Plus can also listen for a “Hey Siri” prompt at all times, not just when they’re plugged in to power as with older models.\r\n\r\n(If you’re afraid of your friends and family waking up your iPhone endlessly by accident, there’s good news on this front, too—iOS 9 now asks you to train Siri by saying a few standard phrases. This doesn’t necessarily lock Siri to your voice, but it reduces the chance that a voice other than yours will set it off accidentally.)\r\n\r\nThe A9 processor itself is faster than the A8 found in the iPhone 6 and 6 Plus—and by a whole lot more than you might expect. Using Primate Labs’s GeekBench 3 testing app, the iPhone 6s models appear to be roughly 60 percent faster then iPhone 6 models at single-processor tests. On GeekBench’s multi-processor test, the 6s models are between 50 and 60 percent faster. Last year’s models were only slightly faster than the iPhone 5s of the previous year—this year’s update offers a much larger boost in speed.\r\n\r\nIn addition to processor power, these new iPhones offer boosted RAM—with 2GB of memory, twice as much as in older iPhones. As I wrote in my review of the iPad Air 2 (the first iOS device with 2GB of RAM): “While the effects are subtle, they’re profound. Safari tabs just stay loaded most of the time. Apps that you used recently-ish snap open immediately rather than doing a bunch of housekeeping. Switching directly between apps feels vastly better, because it’s all instantaneous. More RAM lets the entire system breathe.” Everyone who switches between apps or between pages in Safari will benefit from that increase in RAM, even if they don’t have any idea why everything seems more instantaneous than on their old iPhones.\r\n\r\ngeekbench 6s JASON SNELL\r\nApple claims that battery life on the iPhone 6s and iPhone 6s Plus is more or less the same as on previous models, but there’s a catch—the introduction of the Taptic Engine actually required Apple to reduce the size of the iPhones’ batteries, so they hold less capacity than the iPhone 6 models. However, iOS 9 was tweaked to extend battery life on all iOS devices, and presumably Apple is factoring those improvements (as well as possible increases in battery savings from updated internals) into its battery estimates.\r\n\r\nI wasn’t able to test battery life in time for this review, but based on Apple’s statements I wouldn’t expect the iPhone 6s models to be any better at battery life than the iPhone 6, and in fact I’d probably expect them to be a little bit worse than a new iPhone 6 running iOS 9. Apple continues to balance the thinness and weight of their devices with battery life, shooting for a target battery life that it feels is sufficient. Yes, you can stick a battery case on your phone if you need more battery life, or carry a little external battery with you, but my gut feeling is that iPhone battery life should be getting better, and it just isn’t. Until Apple decides that the base battery life of an iPhone needs to be more than it is today, if you need extended life you should opt for the iPhone 6s Plus—which provides a couple of hours’ worth of life beyond what the iPhone 6s can manage—or invest in an external battery pack of some kind.\r\n\r\nYou probably won’t see any benchmark charts about it, but Touch ID on the iPhone 6s is much faster than it was on the iPhone 5s and iPhone 6. When I put my finger on the home button, I can barely see the lock screen—in a fraction of a second, Touch ID has recognized my finger and unlocked my phone. Yes, we’re talking a very small amount of time saved, but over the course of a day those fractions can add up. I also found that the home buttons on the iPhone 6s felt and sounded noticeably more clicky than those on the iPhone 6.\r\n\r\nSpace considerations\r\nFinally, a word about the stock storage configuration of these phones: 16GB. These are devices that are packed with apps, are shooting 12 megapixel photos, and are capable of shooting 4K video. They are designed (by Apple in California) to devour storage space. I don’t think 16GB is an appropriately large amount of space for a new iPhone in 2015.\r\n\r\nWhat’s worse, I think Apple realizes it, too. But rather than spring for a presumably small increase in the actual cost of the base-model iPhone 6s and iPhone 6s Plus so that they start at 32GB, Apple apparently would prefer that all but the least discriminating iPhone customers shell out an extra $100 for the 64GB model. I’m sure this policy is doing wonders for Apple’s average selling price, but the 16GB model with the price that gets ‘em in the stories is a severely compromised product. This needs to change.\r\n\r\nBottom line\r\nWhile I’ve got a few quibbles about the iPhone 6s and iPhone 6s Plus—the ungenerous 16GB base configuration, a lack of improvement to battery life, a desire for Live Photos to be a bit higher in quality—these are all quibbles around the edges of a remarkable upgrade. Apple has mastered the smartphone game. Every year it seems like there’s just not much more Apple can do to improve upon the previous year’s iPhone, and every year Apple manages to one-up itself.\r\n\r\nThe iPhone 6s, with its upgraded cameras and processors, expanded RAM, and the delightful marvel that is Touch ID, is the best iPhone ever. What’s more remarkable is not that this year’s iPhone is once again the best model ever, it’s the margin by which it improves on last year’s model. It’s a surprisingly wide one.", "published_on": null, "author": "Jason Snell", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "", "updated_on": "2015-09-28T19:49:27.750Z", "upvotes": 0, "title": "iPhone 6s and 6s Plus review: The best iPhone ever, by a wide margin", "added_on": "2015-09-28T19:49:27.750Z"}, "model": "news_readr.article", "pk": 5}, {"fields": {"category": "Space", "body": "Despite its reputation as a forebodingly dusty, desolate and lifeless place, Mars seems to be a little bit wet even today.\r\n\r\nScientists reported on Monday definitive signs of liquid water on the surface of present-day Mars, a finding that will fuel speculation that life, if it ever arose there, could persist to now.\r\n\r\n“This is tremendously exciting,” James L. Green, the director of NASA’s planetary science division, said during a news conference on Monday. “We haven’t been able to answer the question, ‘Does life exist beyond Earth?’ But following the water is a critical element of that. We now have, I think, great opportunities in the right locations on Mars to thoroughly investigate that.”\r\n\r\nIt may be a tipping point for NASA officials who have been reluctant to speculate about the possibility of contemporary life on Mars.\r\n\r\nContinue reading the main story\r\nRELATED IN OPINION\r\n\r\nLetters: Go to Mars, or Save Earth?SEPT. 24, 2015\r\nOp-Ed Contributor: Let’s Not Move to MarsSEPT. 21, 2015\r\n“I can’t imagine that it won’t be a high priority with the scientific community,” said John M. Grunsfeld, NASA’s associate administrator for science, who said a mission in the 2020s could carry experiments to look directly for life.\r\n\r\nContinue reading the main story\r\nGRAPHIC\r\nStreaks of Flowing Water on Mars\r\nImages showing what scientists say is definitive evidence of salty liquid water flowing on Mars.\r\n\r\n\r\n OPEN GRAPHIC\r\nIn a paper published in the journal Nature Geoscience, scientists identified waterlogged molecules — salts of a type known as perchlorates — on the surface in readings from orbit.\r\n\r\n“That’s a direct detection of water in the form of hydration of salts,” said Alfred S. McEwen, a professor of planetary geology at the University of Arizona, the principal investigator of images from a high-resolution camera on NASA’s Mars Reconnaissance Orbiter and one of the authors of the new paper. “There pretty much has to have been liquid water recently present to produce the hydrated salt.”\r\n\r\nBy “recently,” Dr. McEwen said he meant “days, something of that order.”\r\n\r\nAlthough young Mars was inundated by rivers, lakes and maybe even an ocean a few billion years ago, the modern moisture is modest. Scientists have long known that large amounts of water remain — but frozen solid in the polar ice caps. There have been fleeting hints of recent liquid water, like fresh-looking gullies, but none have proved convincing.\r\n\r\nIn 2011, Dr. McEwen and colleagues discovered in photographs from the orbiter dark streaks descending along slopes of craters, canyons and mountains. The streaks lengthened during summer, faded as temperatures cooled, then reappeared the next year.\r\n\r\nThey named the streaks recurrent slope linae, or R.S.L.s, and many thousands of them have now been spotted. “It’s really surprisingly extensive,” Dr. McEwen said.\r\n\r\nContinue reading the main story\r\nRELATED COVERAGE\r\n\r\ninteractive 28 Months on MarsDEC. 8, 2014\r\nAndrew Rader is in the running to be selected by the Dutch venture Mars One to try to reach the planet by 2025.Basics: A One-Way Trip to Mars? Many Would Sign UpDEC. 8, 2014\r\nA panoramic view of the surface of Mars from the Curiosity rover. Mount Sharp can be seen in the distance.Mars Rover Finds Stronger Potential for LifeDEC. 8, 2014\r\nAn artist rendering of what recent research suggests Mars might have looked like around 4 billion years ago, when most researchers think the planet was considerably warmer than it is today.Ancient Mars Had an Ocean, Scientists SayMARCH 5, 2015\r\nScientists suspected that water played a critical role in the phenomenon, perhaps similar to the way concrete darkens when wet and returns to its original color when dry.\r\n\r\nPhoto\r\n\r\nThe dark streaks, known as recurring slope linae, have also been observed at Hale Crater. Credit Jet Propulsion Laboratory/University of Arizona/NASA\r\nBut that was just an educated guess.\r\n\r\nLujendra Ojha, a graduate student at the Georgia Institute of Technology, turned to another instrument on the orbiter that identifies types of molecules by which colors of light they absorb. But this instrument, a spectrometer, is not as sharp as the camera, making it hard to zoom in on readings from the narrow R.S.L.s.\r\n\r\nAdvertisement\r\n\r\nContinue reading the main story\r\n“We had to come up with new techniques and novel ways to do analysis of the chemical signature,” said Mr. Ojha, the lead author of the Nature Geoscience article.\r\n\r\nThe researchers were able to identify the telltale sign of a hydrated salt at four locations. In addition, the signs of the salt disappeared when the streaks faded. “It’s very definitive there is some sort of liquid water,” Mr. Ojha said.\r\n\r\nThe perchlorate salts lower the freezing temperature, and the water remains liquid. The average temperature of Mars is about minus 70 degrees Fahrenheit, but summer days near the Equator can reach an almost balmy 70.\r\n\r\nMany mysteries remain. For one, scientists do not know where the water is coming from.\r\n\r\n“There are two basic origins for the water: from above or from below,” Dr. McEwen said. The perchlorates could be acting like a sponge, absorbing moisture out of the air, but measurements indicate very low humidity on Mars — only enough for 10 microns, or about 1/2,500th of an inch, of rain across the planet if all of the wetness were wrung out of the air.\r\n\r\nContinue reading the main story\r\nNASA’s Next Horizon in Space\r\nSince New Horizons beamed back photos of Pluto, the question has loomed: What’s next? More than 1,600 Times readers shared their ideas.\r\n\r\n\r\nThat idea cannot be entirely ruled out if the lower part of the atmosphere turns out more humid than currently thought.\r\n\r\n“We have very poor measurements of relative humidity near the surface,” Dr. McEwen said.\r\n\r\nThe other possibility is underground aquifers, frozen solid during winter, melting during summer and seeping to the surface.\r\n\r\nLiquid water is considered one of the essential ingredients for life, and its presence raises the question of whether Mars, which appears so dry and barren, could possess niches of habitability for microbial Martians.\r\n\r\nChristopher P. McKay, an astrobiologist at NASA’s Ames Research Center in Mountain View, Calif., does not think the R.S.L.s are a very promising place to look. For the water to be liquid, it must be so salty that nothing could live there, he said. “The short answer for habitability is it means nothing,” he said.\r\n\r\nContinue reading the main story\r\nRECENT COMMENTS\r\n\r\nroderick eyer 16 minutes ago\r\nMore water on Mars than in California. Good job, NASA. Didn't the observance of polar ice caps on Mars clue you in? Could't those billions...\r\nSusanna 16 minutes ago\r\nThere was life on Mars but it became extinct because of man-made climate change. ;-)\r\nRajeevA 16 minutes ago\r\nAs I contemplate this amazing discovery, the obstreperous politicians fade into background noise and then there is just silence. In the not...\r\nSEE ALL COMMENTS  WRITE A COMMENT\r\nHe pointed to Don Juan Pond in Antarctica, which remains liquid year round in subzero temperatures because of high concentrations of calcium chloride salt. “You fly over it, and it looks like a beautiful swimming pool,” Dr. McKay said. “But the water has got nothing.”\r\n\r\nEarthly life adapts to many hostile environments, but Don Juan Pond is lifeless.\r\n\r\nContinue reading the main story\r\nBreaking News Alerts\r\nSign up to receive an email from The New York Times as soon as important news breaks around the world.\r\n\r\n\r\nOthers are not so certain. David E. Stillman, a scientist at the Southwest Research Institute’s space studies department in Boulder, Colo., said water for the streaks might be different in different regions. In some, they form only during the warmest times, suggesting that those waters might not be too salty for microbes.\r\n\r\n“If it was too salty, they would be flowing year round,” Dr. Stillman said. “We might be in that Goldilocks zone.”\r\n\r\nEven though R.S.L.s appear to be some of the most intriguing features on Mars, NASA has no plans to get a close-up look anytime soon.\r\n\r\nR.S.L.s are treated as special regions that NASA’s current robotic explorers are barred from because the rovers were not thoroughly sterilized, and NASA worries that they might be carrying microbial hitchhikers from Earth that could contaminate Mars.\r\n\r\nAdvertisement\r\n\r\nContinue reading the main story\r\nOf the spacecraft NASA has sent to Mars, only the two Viking landers in 1976 were baked to temperatures hot enough to kill Earth microbes. NASA’s next Mars rover, scheduled to launch in 2020, will be no cleaner. Sterilizing spacecraft, which requires electronics and systems that can withstand the heat of baking, adds to the cost and complicates the design.\r\n\r\nIn selecting the landing site for the 2020 rover, the space agency is ruling out places that might be habitable, including those with R.S.L.s.\r\n\r\nThat prohibition may continue even though two candidate R.S.L.s have been identified on the mountain in Gale Crater that NASA’s Curiosity rover is now exploring, a mile or two from its planned path.\r\n\r\nNASA and the Curiosity team could decide to approach the streaks without driving onto them, or to simply observe from a distance. The rover is still probably a couple of years away.\r\n\r\nCONTINUE READING THE MAIN STORY\r\n134\r\nCOMMENTS\r\nNASA officials did not reject the possibility of a detour, although they said it would require analysis and debate.\r\n\r\nIn an interview after the news conference, Dr. Green of NASA said that if the streaks in the Gale Crater turned out to be R.S.L.s, the space agency would consider how much of a contamination threat Curiosity, irradiated by ultraviolet light for several years, might pose to a potential Martian habitat.\r\n\r\n“If we can go within 20 meters, we can zap it with a laser,” Dr. Green said, referring to an instrument that identifies material inside a rock by the colors of light it emits as it is vaporized. “Then we can learn much more about the details what’s in those R.S.L.’s. If we can get closer and actually scoop it up, that would be even better.”", "published_on": "2015-09-28T19:49:43Z", "author": "KENNETH CHANG", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "img/fire1.jpg", "updated_on": "2015-10-03T19:22:11.861Z", "upvotes": 0, "title": "NASA Says Signs of Water Flowing on Mars, Possible Niches for Life", "added_on": "2015-09-28T19:49:56.536Z"}, "model": "news_readr.article", "pk": 6}, {"fields": {"category": "Auto", "body": "The biggest compliment you could possibly give the Google driverless car team is that experiencing their groundbreaking product feels utterly unremarkable. Dull, even.\r\nLet me explain.\r\nThis week I, along with a heap of other reporters, was given a ride in two of their driverless vehicles.\r\nThe first was a modified Lexus that has been out on the streets around here for well over a year now, and is improving and learning every day as new scenarios are logged and analysed by the team.\r\nThis version, which is the most \"ready\" for the roads, though still years off, is essentially a normal car. Except it drives itself.\r\nThe second \"car\" (at what point does something stop being a car?) was more interesting, and is a better reflection of where Google is ultimately going with all this.\r\nGoogle's self-drive carImage copyrightGoogle\r\nImage caption\r\nThe prototype car doesn't have a steering wheel and barely any controls at all\r\nSafe and cautious\r\nIt's an odd little pod, a prototype for a fully autonomous vehicle. No steering wheel. No pedals. Nothing really - save for a couple of chairs with a control panel in between.\r\nThe prototype was unveiled earlier this year, but we didn't hear much about it. Now, Google had set up an obstacle course on top of one of its buildings. Across the makeshift course were \"hazards\" - a chap on a bike, a car pulling out, a man walking aimlessly across us. Naturally, the car dealt with all this impeccably.\r\nI shared my test ride with the Guardian's Jemima Kiss, and while Google wouldn't let us film or take pictures in the vehicle - I did convince them to let me record our experience for this week's edition of Tech Tent. So do have a listen to that when our podcast goes live on Friday at about 17:00 BST.\r\nSo why unremarkable? Well, like any good technology, the driverless car technology just works.\r\nAs much as I'd like to write here about the white-knuckle \"Oh my gosh, there's no driver!\" ride I had in a prototype car, that really was not the case.\r\nIt was slow. It was cautious. It was safe, a more attentive driver than any human could possibly ever be.\r\nAnd later that evening, as I snaked my way back to San Francisco on the four-to-five lane wide Interstate 880, I wished it was the Google car driving me home.\r\nSunday driver\r\nThe pod demo was in a highly controlled environment. Nothing was ever going to go wrong (although there is a big, fat emergency stop button in the car if needs be).\r\nThe Lexus demo ride, on the other hand, was around Google's headquarters in the streets of Mountain View. It's a quiet town, but one that has enough bustle to make the trip a considerable challenge for the car.\r\nAnd indeed off it went, pootling through the streets, being patient with traffic - never cutting anyone up or changing lanes at the last moment.\r\nLexus carsImage copyrightGoogle\r\nImage caption\r\nThe Lexus cars are able to go on public streets\r\nIt won't ever cut corners, or do that tiny burst of speed to nip through the lights as they change. When the lights do go green, it pauses for a second before pulling away, just in case.\r\nIt's a Sunday driver, every day of the week.\r\nThat, obviously, is a good thing. It's far safer than a human. The brief delay before pulling away on a green light is intentional - a huge proportion of accidents at traffic lights happen in that first moment, as a car whizzes through a red light and clatters into anyone who's pulled away promptly.\r\nBut just because it's safe doesn't meant it won't be massively frustrating - particularly if you're desperate to get to work or in any other kind of hurry that required a bit of (legal) urgency on the road.\r\nThat's a terrible complaint, isn't it? The impeccable standards are a sign the technology is really quite magnificent.\r\nBut like dating someone who is just \"too nice\", the Google car will start to grate on you a bit.\r\nBoggled by a jogger\r\nAs Google works its way through the regulatory hoops, and gains confidence, the next focus will be on just how ready this technology is to hit the streets.\r\nIn the test scenario, Google took us on public roads, with common complications - roadworks, road closures and pretty heavy traffic. It was the end of the school day, and so we had parents and children haphazardly crossing the road.\r\nAt one point, a skateboarder rolled towards us. The car's idiot detection sensor (to use its unofficial title) instantly knew to give him a wide berth. On the on-board computer, you could see how the technology had broken down the hazard: human + object (the skateboard) + fast movement = stop.\r\nBut we did see how the car's nervousness - which is the only way I can describe it - sometimes got it wrong. At one moment in our journey, a jogger ran by. He was on the opposite side of the road, and any human eye would have instinctively known he posed no danger.\r\nBut the Google car panicked, hitting the brakes for an emergency stop.\r\nLuckily, there was nobody behind us, or I'm sure they'd have gone into the back of us. Google's engineer told me that if a car had been right behind us it wouldn't have stopped so suddenly.\r\nBut suppose the jogger had been a danger? Would the car have ploughed into him rather than causing a crash from behind? It's the classic ethical dilemma that has kept psychologists debating for centuries.\r\nThe way Google sees it is that even with those theoretical scenarios - where it's forced to choose between what it thinks is the least harmful - the Google car is still far smarter than a human, and, crucially, will save thousands of lives by existing in the first place.\r\nRiding in a Google car may be slow and boring, but the effect it will have on the world certainly isn't.\r\nGoogle's view of a driverless future\r\nSergey BrinImage copyrightGoogle\r\nImage caption\r\nSergey Brin dropped into the demo day to discuss long-term plans\r\nSergey Brin, Google's co-founder, thinks there's space for both types of driving experience on our roads. \"I love the idea of being out on the open road that's kind of curvy and fun - you're driving, really getting into it,\" he said.\r\n\"But in practice that's probably 1% of my experience.\r\n\"Typically I'm in stop-and-go traffic, and some traffic jam, or just going from light to light on a pretty straight road, mostly just trying to make sure nobody does anything weird in front of me and I don't crash into them.\r\n\"I think we need to see both of those worlds, and I think there's a future for both of those. I don't think we're going to see no human driver any time soon.\r\n\"And I think there's always going to be a pleasure in being able to hit the open road and enjoy that.\"", "published_on": "2015-10-03T20:47:10Z", "author": "Dave Lee", "downvotes": 0, "img_secondary": "", "summary": null, "img_primary": "img/google.jpg", "updated_on": "2015-10-03T20:48:02.940Z", "upvotes": 0, "title": "Google's driverless car is brilliant but so boring", "added_on": "2015-10-03T20:48:02.940Z"}, "model": "news_readr.article", "pk": 7}, {"fields": {"category": "Security", "body": "About 15 gigabytes of data including names, addresses and donations have been published online following a hack attack on crowdfunding site Patreon.\r\nPatreon allows people to make regular donations to artists for projects.\r\nProjects currently seeking funding include a science video series featuring former International Space Station commander Chris Hadfield.\r\nCredit card details were not stolen, said chief executive Jack Conte.\r\n\"We do not store full credit card numbers on our servers and no credit card numbers were compromised,\" he wrote on the firm's blog.\r\n\"Although accessed, all passwords, social security numbers and tax form information remain safely encrypted with a 2048-bit RSA key.\"\r\nHe said that passwords were not stored unencrypted but urged site users to change their login details as a precaution.\r\nAccording to Patreon's statistics the site was attracting 16 million viewers per month in June 2015.\r\nThe site was breached via a test or \"debug\" version of the site - useful to developers but in this case also visible to the public, said Mr Conte.\r\nSecurity expert Troy Hunt said the data published online so far appears to be genuine.\r\n\"At the very least, it means mapping individuals with the Patreon campaigns they supported,\" he told Ars Technica.\r\nMr Hunt added that he had identified 2.3 million unique email addresses in the stolen data, including his own.\r\nHowever, he also tweeted that \"many tens of thousands\" appeared to be auto-generated.\r\n", "published_on": "2015-10-03T20:49:34Z", "author": "Staff Author", "downvotes": 0, "img_secondary": "./_85874768_85874767.jpg", "summary": null, "img_primary": "img/2.jpg", "updated_on": "2015-10-03T20:50:21.523Z", "upvotes": 0, "title": "Crowdfunding site Patreon hacked data leaked", "added_on": "2015-10-03T20:50:21.523Z"}, "model": "news_readr.article", "pk": 8}, {"fields": {"category": "eCommerce", "body": "The online retailer said it had made the decision to avoid \"customer confusion\" and the devices will be removed from sale by 29 October.\r\nAmazon wants to sell products that work with its in-house streaming video service known as Prime Video.\r\nPrime Video is not available on Apple TV and Google's Chromecast.\r\nBut it can be watched via an app on Apple and Android smartphones and tablets.\r\nAmazon said along with its own Fire TV, it will continue to sell other companies' devices that are compatible with Prime Video.\r\nThese include Microsoft's Xbox, and Sony's Playstation.\r\nAmazon has rapidly expanded its online content, using it to attract subscribers to its Prime loyalty membership scheme which offers fast delivery on purchases.\r\n'Sledgehammer approach'\r\nGoogle has just unveiled a new version of its Chromecast TV device, and Apple is due to release the latest version of its TV this month.\r\nRichard Windsor, analyst at Edison Investment Research, said that by refusing to sell such products, Amazon could be diminishing the experience of its customers.\r\n\"These days it is all about enticing users to join one's community and then providing great digital life services so that they stay.\r\n\"This is why Amazon's sledgehammer approach ... is very likely to backfire.\r\n\"This approach implies that Amazon is doing everything it can to prevent users from accessing what very well may be superior services from its competitors,\" he said.\r\nTough tactics\r\nAmazon has used similar tactics with book publishers.\r\nLast year it blocked pre-orders for some books from the publisher Hachette, while the two sides negotiated over prices.\r\nMany authors were angered by the move and accused Amazon of being anti-competitive.", "published_on": "2015-10-03T20:50:46Z", "author": "Staff Author", "downvotes": 0, "img_secondary": "", "summary": "Amazon is to stop selling video-streaming TV devices from Google and Apple because they don't \"interact well\" with its own media service.", "img_primary": "img/_85867696_85867695.jpg", "updated_on": "2015-10-03T20:55:06.000Z", "upvotes": 0, "title": "Amazon bars the sale of Apple and Google TV devices", "added_on": "2015-10-03T20:51:19.650Z"}, "model": "news_readr.article", "pk": 9}, {"fields": {"category": "IT", "body": "Google Inc has morphed into Alphabet Inc. After U.S. markets closed on Friday, Alphabet replaced Google as the publicly traded company that will house Google’s search and Web advertising businesses, maps, YouTube and its “moonshot” ventures such as driverless cars. Google’s class A shares and class C shares will automatically convert into the same number of Alphabet class A shares and class C shares and start trading on the Nasdaq from Monday. The ticker symbols will not change. The structural overhaul, announced in August, is intended to separate the company’s core businesses from ventures such as the driverless cars, glucose-monitoring contact lenses and Internet-connected high-altitude balloons. Google’s Sidewalk Labs, a company dedicated to coming up with technologies to improve urban city infrastructure such as a free WiFi program, will also be a part of the Alphabet business. The core businesses will be called Google and operate as a wholly-owned subsidiary of Alphabet. Sunday Pica will head Google. Alphabet will be run by Google co-founder Larry Page and each of its businesses will have its own chief executive. Starting from the company’s fourth quarter in January, Alphabet will have two reporting units – Google and all other Alphabet businesses taken as a whole. Investors have cheered the move, saying it will give them greater visibility into the financial performance of Google’s highly profitable core businesses. Alphabet’s businesses will also include connected home products maker Nest, venture capital arm Google Ventures, and Google Capital, which invests in larger tech companies. - See more at: http://indianexpress.com/article/technology/tech-news-technology/bye-bye-google-it-is-alphabet-now/#sthash.Nje6I3fX.dpuf", "published_on": "2015-10-03T20:51:58Z", "author": "Reuters", "downvotes": 0, "img_secondary": "", "summary": "After U.S. markets closed on Friday, Alphabet replaced Google as the publicly traded company that will house Google’s search and Web advertising businesses, maps, YouTube and its “moonshot” ventures such as driverless cars. ", "img_primary": "img/googlealphabet_big_23.jpg", "updated_on": "2015-10-03T20:54:21.924Z", "upvotes": 0, "title": "Bye bye Google, it is Alphabet now", "added_on": "2015-10-03T20:52:23.240Z"}, "model": "news_readr.article", "pk": 10}, {"fields": {"codename": "add_logentry", "name": "Can add log entry", "content_type": 1}, "model": "auth.permission", "pk": 1}, {"fields": {"codename": "change_logentry", "name": "Can change log entry", "content_type": 1}, "model": "auth.permission", "pk": 2}, {"fields": {"codename": "delete_logentry", "name": "Can delete log entry", "content_type": 1}, "model": "auth.permission", "pk": 3}, {"fields": {"codename": "add_permission", "name": "Can add permission", "content_type": 2}, "model": "auth.permission", "pk": 4}, {"fields": {"codename": "change_permission", "name": "Can change permission", "content_type": 2}, "model": "auth.permission", "pk": 5}, {"fields": {"codename": "delete_permission", "name": "Can delete permission", "content_type": 2}, "model": "auth.permission", "pk": 6}, {"fields": {"codename": "add_group", "name": "Can add group", "content_type": 3}, "model": "auth.permission", "pk": 7}, {"fields": {"codename": "change_group", "name": "Can change group", "content_type": 3}, "model": "auth.permission", "pk": 8}, {"fields": {"codename": "delete_group", "name": "Can delete group", "content_type": 3}, "model": "auth.permission", "pk": 9}, {"fields": {"codename": "add_user", "name": "Can add user", "content_type": 4}, "model": "auth.permission", "pk": 10}, {"fields": {"codename": "change_user", "name": "Can change user", "content_type": 4}, "model": "auth.permission", "pk": 11}, {"fields": {"codename": "delete_user", "name": "Can delete user", "content_type": 4}, "model": "auth.permission", "pk": 12}, {"fields": {"codename": "add_contenttype", "name": "Can add content type", "content_type": 5}, "model": "auth.permission", "pk": 13}, {"fields": {"codename": "change_contenttype", "name": "Can change content type", "content_type": 5}, "model": "auth.permission", "pk": 14}, {"fields": {"codename": "delete_contenttype", "name": "Can delete content type", "content_type": 5}, "model": "auth.permission", "pk": 15}, {"fields": {"codename": "add_session", "name": "Can add session", "content_type": 6}, "model": "auth.permission", "pk": 16}, {"fields": {"codename": "change_session", "name": "Can change session", "content_type": 6}, "model": "auth.permission", "pk": 17}, {"fields": {"codename": "delete_session", "name": "Can delete session", "content_type": 6}, "model": "auth.permission", "pk": 18}, {"fields": {"codename": "add_article", "name": "Can add article", "content_type": 7}, "model": "auth.permission", "pk": 19}, {"fields": {"codename": "change_article", "name": "Can change article", "content_type": 7}, "model": "auth.permission", "pk": 20}, {"fields": {"codename": "delete_article", "name": "Can delete article", "content_type": 7}, "model": "auth.permission", "pk": 21}, {"fields": {"username": "nikjohn", "first_name": "", "last_name": "", "is_active": true, "is_superuser": true, "is_staff": true, "last_login": "2015-10-03T19:12:42.635Z", "groups": [], "user_permissions": [], "password": "pbkdf2_sha256$20000$NIpkZw1m9zMW$Jm12WH/YavjJtQRh5ltcmc8pWGwrvgTni0BIYqSuuHQ=", "email": "jonva.nightfall@gmail.com", "date_joined": "2015-09-28T14:51:36.943Z"}, "model": "auth.user", "pk": 1}, {"fields": {"action_flag": 1, "action_time": "2015-09-28T19:46:29.401Z", "object_repr": "Article object", "object_id": "1", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 1}, {"fields": {"action_flag": 1, "action_time": "2015-09-28T19:47:37.977Z", "object_repr": "Article object", "object_id": "2", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 2}, {"fields": {"action_flag": 1, "action_time": "2015-09-28T19:48:13.014Z", "object_repr": "Article object", "object_id": "3", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 3}, {"fields": {"action_flag": 1, "action_time": "2015-09-28T19:48:42.540Z", "object_repr": "Article object", "object_id": "4", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 4}, {"fields": {"action_flag": 1, "action_time": "2015-09-28T19:49:27.751Z", "object_repr": "Article object", "object_id": "5", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 5}, {"fields": {"action_flag": 1, "action_time": "2015-09-28T19:49:56.537Z", "object_repr": "Article object", "object_id": "6", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 6}, {"fields": {"action_flag": 2, "action_time": "2015-10-03T19:13:29.911Z", "object_repr": "Article object", "object_id": "6", "change_message": "Changed img_primary.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 7}, {"fields": {"action_flag": 2, "action_time": "2015-10-03T19:22:05.036Z", "object_repr": "Article object", "object_id": "6", "change_message": "Changed img_primary.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 8}, {"fields": {"action_flag": 2, "action_time": "2015-10-03T19:22:11.863Z", "object_repr": "Article object", "object_id": "6", "change_message": "Changed img_primary.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 9}, {"fields": {"action_flag": 1, "action_time": "2015-10-03T20:48:02.941Z", "object_repr": "Article object", "object_id": "7", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 10}, {"fields": {"action_flag": 1, "action_time": "2015-10-03T20:50:21.524Z", "object_repr": "Article object", "object_id": "8", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 11}, {"fields": {"action_flag": 1, "action_time": "2015-10-03T20:51:19.650Z", "object_repr": "Article object", "object_id": "9", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 12}, {"fields": {"action_flag": 1, "action_time": "2015-10-03T20:52:23.241Z", "object_repr": "Article object", "object_id": "10", "change_message": "", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 13}, {"fields": {"action_flag": 2, "action_time": "2015-10-03T20:54:21.925Z", "object_repr": "Article object", "object_id": "10", "change_message": "Changed summary.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 14}, {"fields": {"action_flag": 2, "action_time": "2015-10-03T20:55:06.001Z", "object_repr": "Article object", "object_id": "9", "change_message": "Changed summary and body.", "user": 1, "content_type": 7}, "model": "admin.logentry", "pk": 15}]